const commandCenters = [
  {
    "name": "องค์การบริหารส่วนจังหวัดเชียงใหม่",
    "province": "เชียงใหม่",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับพื้นฐาน",
    "lat": 18.83875595,
    "lng": 98.97615633
  },
  {
    "name": "54 ศูนย์รับแจ้งเหตุและสั่งการ จังหวัดแพร่",
    "province": "แพร่",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับพื้นฐาน",
    "lat": 18.1159898,
    "lng": 99.4828205
  },
  {
    "name": "องค์การบริการส่วนจังหวัดกระบี่",
    "province": "กระบี่",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับพื้นฐาน",
    "lat": 8.060682823,
    "lng": 98.90516117
  },
  {
    "name": "ศูนย์บริการการแพทย์ฉุกเฉินกรุงเทพมหานคร(ศูนย์เอราวัณ)",
    "province": "กรุงเทพมหานคร",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับพื้นฐาน",
    "lat": 13.7661845,
    "lng": 100.4844482
  },
  {
    "name": "องค์การบริหารส่วนจังหวัดกาญจนบุรี",
    "province": "กาญจนบุรี",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับพื้นฐาน",
    "rnis": true,
    "lat": 14.05006818,
    "lng": 99.50972563
  },
  {
    "name": "ศูนย์รับแจ้งเหตุและสั่งการ อบจ.ชุมพร",
    "province": "ชุมพร",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับพื้นฐาน",
    "lat": 10.49257259,
    "lng": 99.17875841
  },
  {
    "name": "องค์การบริหารส่วนจังหวัดปัตตานี",
    "province": "ปัตตานี",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับพื้นฐาน",
    "lat": 6.868475,
    "lng": 101.2471199
  },
  {
    "name": "ศูนย์รับแจ้งเหตุและสั่งการ (อบจ.พัทลุง)",
    "province": "พัทลุง",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับพื้นฐาน",
    "lat": 7.6177011,
    "lng": 100.0709114
  },
  {
    "name": "ศูนย์รับแจ้งเหตุและสั่งการ (อบจ.มหาสารคาม)",
    "province": "มหาสารคาม",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับพื้นฐาน",
    "lat": 16.20298099,
    "lng": 103.2895879
  },
  {
    "name": "องค์การบริหารส่วนจังหวัดระยอง",
    "province": "ระยอง",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับพื้นฐาน",
    "lat": 12.68057864,
    "lng": 101.2360558
  },
  {
    "name": "ศูนย์รับแจ้งเหตุและสั่งการจังหวัดลำพูน",
    "province": "ลำพูน",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับพื้นฐาน",
    "lat": 18.53263679,
    "lng": 99.02316335
  },
  {
    "name": "33-องค์การบริหารส่วนจังหวัดศรีสะเกษ",
    "province": "ศรีสะเกษ",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับพื้นฐาน",
    "lat": 15.12031674,
    "lng": 104.3217077
  },
  {
    "name": "ศูนย์รับแจ้งเหตุและสั่งการ (อบจ.)",
    "province": "สงขลา",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับพื้นฐาน",
    "rnis": true,
    "lat": 7.140585189,
    "lng": 100.5728657
  },
  {
    "name": "ศูนย์รับแจ้งเหตุและสั่งการ อบจ.สระแก้ว",
    "province": "สระแก้ว",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับพื้นฐาน",
    "lat": 13.7742756,
    "lng": 102.1804041
  },
  {
    "name": "ศูนย์รับแจ้งเหตุและสั่งการฯ (สุพรรณบุรี)",
    "province": "สุพรรณบุรี",
    "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับพื้นฐาน",
    "rnis": true,
    "lat": 14.46392635,
    "lng": 100.1326385
  },
  {
    "name": "อบจ.อุบลราชธานี",
    "province": "อุบลราชธานี",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับพื้นฐาน",
    "lat": 15.24522882,
    "lng": 104.8472988
  },
  {
    "name": "โรงพยาบาลเชียงรายประชานุเคราะห์",
    "province": "เชียงราย",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง ",
    "lat": 19.9008465,
    "lng": 99.82971331
  },
  {
    "name": "โรงพยาบาลพระจอมเกล้า",
    "province": "เพชรบุรี",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 13.1184386,
    "lng": 99.9379894
  },
  {
    "name": "กู้ชีพ รพ.เพชรบูรณ์",
    "province": "เพชรบูรณ์",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 16.42730625,
    "lng": 101.1542926
  },
  {
    "name": "โรงพยาบาลเลย",
    "province": "เลย",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 17.48786564,
    "lng": 101.7232678
  },
  {
    "name": "โรงพยาบาลศรีสังวาลย์",
    "province": "แม่ฮ่องสอน",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 19.29985557,
    "lng": 97.97258433
  },
  {
    "name": "ศูนย์รับแจ้งเหตุและสั่งการจังหวัดกาฬสินธุ์",
    "province": "กาฬสินธุ์",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 16.42565559,
    "lng": 103.517975
  },
  {
    "name": "รพท.กำแพงเพชร",
    "province": "กำแพงเพชร",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 16.46320685,
    "lng": 99.52920793
  },
  {
    "name": "โรงพยาบาลขอนแก่น",
    "province": "ขอนแก่น",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 16.4292098,
    "lng": 102.8496406
  },
  {
    "name": "โรงพยาบาลพระปกเกล้า",
    "province": "จันทบุรี",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 12.60370395,
    "lng": 102.1017583
  },
  {
    "name": "โรงพยาบาลพุทธโสธร",
    "province": "ฉะเชิงเทรา",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 13.6862211,
    "lng": 101.0742657
  },
  {
    "name": "โรงพยาบาลชลบุรี",
    "province": "ชลบุรี",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 13.35217409,
    "lng": 100.9830852
  },
  {
    "name": "โรงพยาบาลชัยนาทนเรนทร",
    "province": "ชัยนาท",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 15.19178701,
    "lng": 100.1272601
  },
  {
    "name": "โรงพยาบาลชัยภูมิ",
    "province": "ชัยภูมิ",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 15.80620636,
    "lng": 102.0351952
  },
  {
    "name": "โรงพยาบาลตรัง",
    "province": "ตรัง",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 7.572323822,
    "lng": 99.61955387
  },
  {
    "name": "โรงพยาบาลตราด",
    "province": "ตราด",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 12.24823423,
    "lng": 102.5120286
  },
  {
    "name": "โรงพยาบาลสมเด็จพระเจ้าตากสินมหาราช",
    "province": "ตาก",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 16.87310202,
    "lng": 99.13233629
  },
  {
    "name": "โรงพยาบาลแม่สอด",
    "province": "ตาก",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 16.7099196,
    "lng": 98.57355435
  },
  {
    "name": "รพ.นครนายก",
    "province": "นครนายก",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 14.2082486,
    "lng": 101.2133092
  },
  {
    "name": "โรงพยาบาลนครปฐม",
    "province": "นครปฐม",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 13.81929424,
    "lng": 100.0760508
  },
  {
    "name": "โรงพยาบาลนครพนม",
    "province": "นครพนม",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 17.41402067,
    "lng": 104.7780866
  },
  {
    "name": "โรงพยาบาลมหาราชนครราชสีมา",
    "province": "นครราชสีมา",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 14.98472338,
    "lng": 102.1040449
  },
  {
    "name": "โรงพยาบาลมหาราชนครศรีธรรมราช",
    "province": "นครศรีธรรมราช",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 8.390210058,
    "lng": 99.9721268
  },
  {
    "name": "โรงพยาบาลสวรรค์ประชารักษ์",
    "province": "นครสวรรค์",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 15.67508088,
    "lng": 100.1218442
  },
  {
    "name": "โรงพยาบาลพระนั่งเกล้า",
    "province": "นนทบุรี",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 13.84378897,
    "lng": 100.5078928
  },
  {
    "name": "โรงพยาบาลนราธิวาสราชนครินทร์",
    "province": "นราธิวาส",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 6.414837144,
    "lng": 101.82284
  },
  {
    "name": "โรงพยาบาลน่าน",
    "province": "น่าน",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 18.79448641,
    "lng": 100.7887321
  },
  {
    "name": "โรงพยาบาลบึงกาฬ",
    "province": "บึงกาฬ",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 18.3632757,
    "lng": 103.6527168
  },
  {
    "name": "โรงพยาบาลบุรีรัมย์",
    "province": "บุรีรัมย์",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 15.00492257,
    "lng": 103.1149105
  },
  {
    "name": "โรงพยาบาลปทุมธานี",
    "province": "ปทุมธานี",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 14.0207134,
    "lng": 100.5230268
  },
  {
    "name": "รพท.ประจวบคีรีขันธ์",
    "province": "ประจวบคีรีขันธ์",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 11.80135376,
    "lng": 99.79650151
  },
  {
    "name": "รพ.หัวหิน",
    "province": "ประจวบคีรีขันธ์",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 12.60835118,
    "lng": 99.94873299
  },
  {
    "name": "รพ.เจ้าพระยาอภัยภูเบศร",
    "province": "ปราจีนบุรี",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 14.05449119,
    "lng": 101.3964519
  },
  {
    "name": "โรงพยาบาลพระนครศรีอยุธยา",
    "province": "พระนครศรีอยุธยา",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 14.34383702,
    "lng": 100.5611009
  },
  {
    "name": "โรงพยาบาลพะเยา",
    "province": "พะเยา",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 19.19124064,
    "lng": 99.8780281
  },
  {
    "name": "โรงพยาบาลพังงา",
    "province": "พังงา",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 8.448716116,
    "lng": 98.52699452
  },
  {
    "name": "โรงพยาบาลพิจิตร",
    "province": "พิจิตร",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 16.43508052,
    "lng": 100.3451186
  },
  {
    "name": "โรงพยาบาลพุทธชินราช",
    "province": "พิษณุโลก",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 16.80894167,
    "lng": 100.2638785
  },
  {
    "name": "ศูนย์รับแจ้งเหตุและสั่งการ อบจ.ภูเก็ต",
    "province": "ภูเก็ต",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "rnis": true,
    "lat": 7.881247635,
    "lng": 98.4077898
  },
  {
    "name": "โรงพยาบาลมุกดาหาร",
    "province": "มุกดาหาร",
    "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 16.54210269,
    "lng": 104.7274183
  },
  {
    "name": "โรงพยาบาลยโสธร",
    "province": "ยโสธร", "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 15.78177699,
    "lng": 104.1635009
  },
  {
    "name": "โรงพยาบาลยะลา",
    "province": "ยะลา", "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 6.547793459,
    "lng": 101.2770409
  },
  {
    "name": "โรงพยาบาลร้อยเอ็ด",
    "province": "ร้อยเอ็ด", "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 16.04769468,
    "lng": 103.6532245
  },
  {
    "name": "โรงพยาบาลระนอง",
    "province": "ระนอง", "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 9.963722694,
    "lng": 98.64340149
  },
  {
    "name": "70000-กู้ชีพราชบุรี",
    "province": "ราชบุรี", "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับสูง",
    "lat": 13.53103954,
    "lng": 99.8162195
  },
  {
    "name": "รพท.พระนารายณ์มหาราช",
    "province": "ลพบุรี", "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับสูง",
    "lat": 14.80545881,
    "lng": 100.6556296
  },
  {
    "name": "โรงพยาบาลลำปาง",
    "province": "ลำปาง", "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 18.2869267,
    "lng": 99.5034049
  },
  {
    "name": "โรงพยาบาลสกลนคร",
    "province": "สกลนคร", "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 17.1634049,
    "lng": 104.1556347
  },
  {
    "name": "โรงพยาบาลสตูล",
    "province": "สตูล", "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 6.6179049,
    "lng": 100.0685436
  },
  {
    "name": "โรงพยาบาลสมุทรปราการ",
    "province": "สมุทรปราการ", "type": "หน่วยปฏิบัติการอำนวยการ",
    "level": "ระดับสูง",
    "lat": 13.5837332, "lng": 100.594777
  },
  {
    "name": "โรงพยาบาลสมเด็จพระพุทธเลิศหล้า",
    "province": "สมุทรสงคราม", "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับสูง",
    "lat": 13.4062477, "lng": 99.9954598
  },
  {
    "name": "โรงพยาบาลสมุทรสาคร",
    "province": "สมุทรสาคร", "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับสูง",
    "lat": 13.5539984, "lng": 100.2704954
  },
  {
    "name": "รพ.สระบุรี",
    "province": "สระบุรี", "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับสูง",
    "lat": 14.5341661, "lng": 100.9132209
  },
  {
    "name": "รพท.สิงห์บุรี",
    "province": "สิงห์บุรี", "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับสูง",
    "lat": 14.8967137, "lng": 100.3950452
  },
  {
    "name": "โรงพยาบาลสุโขทัย",
    "province": "สุโขทัย", "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับสูง", "lat": 17.0108526, "lng": 99.793471
  },
  {
    "name": "โรงพยาบาลเกาะสมุย",
    "province": "สุราษฎร์ธานี", "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับสูง", "lat": 9.5218316, "lng": 99.9329211
  },
  {
    "name": "โรงพยาบาลสุราษฎร์ธานี",
    "province": "สุราษฎร์ธานี", "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับสูง", "lat": 9.123759, "lng": 99.3074258
  },
  {
    "name": "โรงพยาบาลสุรินทร์",
    "province": "สุรินทร์", "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับสูง", "lat": 14.8765646, "lng": 103.5027463
  },
  {
    "name": "โรงพยาบาลหนองคาย", "province": "หนองคาย", "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับสูง", "lat": 17.8815467, "lng": 102.7390106
  },
  {
    "name": "โรงพยาบาลหนองบัวลำภู",
    "province": "หนองบัวลำภู", "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับสูง", "lat": 17.1988836, "lng": 102.4547336
  },
  {
    "name": "โรงพยาบาลอ่างทอง", "province": "อ่างทอง", "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับสูง", "lat": 14.5847642, "lng": 100.4495769
  },
  {
    "name": "โรงพยาบาลอำนาจเจริญ", "province": "อำนาจเจริญ", "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับสูง", "lat": 15.8639101, "lng": 104.6212756
  },
  {
    "name": "โรงพยาบาลอุดรธานี",
    "province": "อุดรธานี", "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับสูง", "lat": 17.414876, "lng": 102.777848
  },
  {
    "name": "โรงพยาบาลอุตรดิตถ์", "province": "อุตรดิตถ์", "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับสูง", "lat": 17.6191402, "lng": 100.0844133
  },
  {
    "name": "รพท.อุทัยธานี", "province": "อุทัยธานี", "type": "หน่วยปฏิบัติการอำนวยการ", "level": "ระดับสูง", "lat": 15.3803471, "lng": 100.0173922
  }
];
